<?php

use yii\helpers\Html;
use yii\widgets\ActiveForm;

/* @var $this yii\web\View */
/* @var $model app\models\Product */
/* @var $form yii\widgets\ActiveForm */
?>

<table width="100%" cellspacing="0" cellpadding="0" border="0" class="table-module">
    <tbody>
    <tr class="tab_title">
        <td><b>名词解释：</b></td>
    </tr>
    <tr class="table-module-b2">
        <td>
            <b>生产天数</b> = 下采购单  到 货到头程仓的时间<br>
            <b>物流天数</b> = 头程仓 到 海外仓上架的时间<br>
            <b>安全库存</b> = 仓库需多备的库存天数<br>
            <b>采购频率</b> = 采购员隔多少天采购一次(相当于一次多补几天的货)<br>
            <br>
            <b>持续上升</b>： 3 天 平均销量 &gt; 7天平均销量 &gt; 15天平均销量 &gt; 30 天平均销量<br>
            <b>持续下降</b>： 3 天 平均销量 &lt; 7天平均销量 &lt; 15天平均销量 &lt; 30 天平均销量<br>
            <b>波动上升</b>： (3 天 平均销量 + 7天平均销量) &gt; (15天平均销量 + 30 天平均销量)<br>
            <b>波动下降</b>： (3 天 平均销量 + 7天平均销量) &lt; (15天平均销量 + 30 天平均销量)<br>
            <br>
            <b>可销售库存</b>： 实际库存 - 待下架订单总和<br>
            <b>待上架库存</b>：已收到货，待上架总和<br>
            <b>在途库存</b>：采购未到货或已中转待入库的总和<br>
            <b>计划库存</b>：已产生的补货建议数总和<br>
            <br>
            <b>销售系数</b>：用于统计销量，搞活动期间销量突升的情况下，在原有日均销量计算的基础上，进行时间段范围设置对应的值，平衡获取日均销量<br>
            <b>客单量系数</b>： 用于平衡销量，针对土豪单处理,如某个单同一SKU买了100个,当客单系统为0.1时.系统统计销量只按1个数量统计<br>
            <b>加权系数</b>：当销售走势处于"波动上升"，"波动下降"时，用于获取更精确的日均销量 <br>
            <br>
            <b>最低采购量</b>：供应商产品的属性 <br>
            <b>采购单位</b>：供应商产品的属性，分为“整件”与“散件” ；当为“整件”时，又可以选择属性“补货取整”与“补货不取整”<br>
        </td>
    </tr>
    <tr class="tab_title">
        <td><b>计算公式：</b></td>
    </tr>
    <tr class="table-module-b2">
        <td>
            <b>平均销量</b> = (3 天 平均销量 * 加权值)+( 7天平均销量 * 加权值)+(15天平均销量  * 加权值)+( 30 天平均销量 * 加权值)<br>
            <b>已有库存</b> = (可销售库存 + 在途库存 + 待上架库存 + 计划库存 + 采购库存 - 缺货 - 退件)<br><br>

            <!-- <b>最小库存</b> =  (生产天数 + 物流天数) * 平均销量<br/> -->
            <!-- <b>安全库存</b> =  (生产天数 + 物流天数 + 安全库存) * 平均销量<br/> -->
        </td>
    </tr>
    <tr class="tab_title">
        <td><b>计算逻辑：</b></td>
    </tr>
    <tr class="table-module-b2">
        <td>
            <b>补货模式：</b><br>
            <b>最小备货：原补货数量 = (安全库存  + 最小补货) * 平均销量 - 已有库存;</b><br>
            <b>默认：原补货数量 = (生产天数 + 物流天数 + 安全库存 + 采购频率) * 平均销量 - 已有库存;</b><br>
            <br>
            <b>散件采购</b><br>
            当 <b>原补货数量</b> 小于其 <b>最低采购量</b> 时， <b>补货数量 = 最低采购量</b><br>
            否则， <b>补货数量 = 原补货数量 ;</b><br>
            <br>
            <b>整件采购</b>： 分为 <b>补货取整</b> 与 <b>补货不取整</b> 两种情况<br>
            <b>补货取整</b>： <b>原补货数量 </b> 除以 <b>最低采购量</b> 所得的 <b>整数</b>;<br>
            <b>补货取余</b>： <b>原补货数量 </b> 除以 <b>最低采购量</b> 所得的 <b>余数</b>;<br>
            <br>
            <b>补货取整</b><br>
            当 <b>补货取余</b> 为0时，补货数量 = 原补货数量;<br>
            当 <b>补货取余</b> 小于 <b>最低采购量</b> 的50%时，<b>补货数量 = 补货取整 * 最低采购量;</b><br>
            当 <b>补货取余</b> 大于 <b>最低采购量</b> 的50%时，<b>补货数量 = (补货取整 +1) * 最低采购量;</b><br>
            <br>
            <b>补货不取整</b><br>
            当 <b>补货取余</b> 为0时，补货数量 = 原补货数量;<br>
            当 <b>补货取余</b> 小于 <b>最低采购量</b> 的25%时，<b>补货数量 = 补货取整 * 最低采购量;</b><br>
            当 <b>补货取余</b> 大于 <b>最低采购量</b> 的25%，且小于 <b>最低采购量</b> 的75%时，<b>补货数量 = (补货取整+0.5) * 最低采购量;</b><br>
            当 <b>补货取余</b> 大于 <b>最低采购量</b> 的75%时，<b>补货数量 = (补货取整 +1) * 最低采购量;</b><br>
        </td>
    </tr>
    </tbody>
</table>
